Repository: SuperbCoders/menuuu-backend
Catalog: menu_backend/locale/*/LC_MESSAGES/django.po
Languages: ru

source: English
ru: английский

source: Russian
ru: русский

source: Menu service for restaurants
ru: Сервис меню для ресторанов

source: menu
ru: меню

source: menus
ru: меню

source: Title
ru: Название

source: Restaurant
ru: Ресторан

source: Published
ru: опубликовано

source: menu section
ru: раздел меню

source: menus sections
ru: разделы меню

source: Menu
ru: Меню

source: course
ru: блюдо

source: courses
ru: блюда

source: Composition
ru: Состав

source: Menu section
ru: Раздел меню

source: Price
ru: Цена

source: Cooking time
ru: Время приготовления

source: Options
ru: Опции

source: restaurant category
ru: Категория ресторана

source: restaurant categories
ru: Категории ресторанов

source: Category name
ru: Название категории

source: restaurant
ru: ресторан

source: restaurants
ru: рестораны

source: Restaurant name
ru: Название ресторана

source: Restaurant description
ru: Описание ресторана

source: Nickname
ru: Псевдоним для URL

source: Logo
ru: Логотип

source: Picture
ru: Изображение

source: Restaurant category
ru: Категория ресторана

source: Number of stars
ru: Количество звезд

source: Country
ru: Страна

source: City
ru: Город

source: Street
ru: Улица

source: Building
ru: Номер дома

source: Address details
ru: Дополнительно

source: Zip code
ru: Почтовый код

source: Longitude
ru: Долгота

source: Latitude
ru: Широта

source: Phone number
ru: Номер телефона

source: Site URL
ru: Сайт

source: Generating a QR code for URL: {}
ru: Генерируется QR код для URL: {}

source: Restaurant owner
ru: Владелец ресторана

source: Restaurant worker
ru: Работник ресторана

source: restaurant ownership or employment
ru: должность пользователя в ресторане

source: restaurant ownerships or employments
ru: должности пользователей в ресторанах

source: User
ru: Пользователь

source: Position
ru: Положение

source: Get the menu
ru: Получить меню

source: Get the current menu for the specified restaurant
ru: Получить текущее меню указанного ресторана

source: The primary key of the restaurant
ru: Первичный ключ ресторана

source: Return the menu at this language
ru: Отобразить меню на этом языке

source: The identifier of the restaurant (same with 'id' parameter)
ru: Идентификатор ресторана (совпадает с параметром id)

source: The name of the restaurant
ru: Название ресторана

source: The description of the restaurant
ru: Описание ресторана

source: The contact phone number of the restaurant
ru: Контактный телефон ресторана

source: The restaurant's site url
ru: Адрес сайта ресторана

source: The URL of restaurant's logo image, if available
ru: URL логотипа ресторана

source: The URL of restaurant's picture, if available
ru: URL изображения ресторана

source: Number of stars. Greater value means greater quality and greater prices. Worst value is 1 while the value 0 means information is not available.
ru: Количество звезд. Чем оно больше, тем ресторан лучше и дороже. Наименьшее значение равно 1, а 0 означает, что информация отсутствует

source: Category name. It may be somewhat like 'italian', 'chinese', etc.
ru: Название категории - например, 'итальянский', 'китайский' и т.п.

source: Restaurant address
ru: Адрес ресторана

source: Country name
ru: Название страны

source: City name
ru: Название города

source: Street name
ru: Название улицы

source: Building number
ru: Номер дома

source: Address details like entrance number, level number, etc.
ru: Подробности адреса - например, подъезд или этаж

source: Zip/postal code
ru: Почтовый код

source: Latitude if available
ru: Широта

source: Longitude if available
ru: Долгота

source: Restaurant's menu
ru: Меню ресторана

source: Menu title
ru: Заголовок меню

source: Menu sections
ru: Разделы меню

source: Menu section title
ru: Название раздела меню

source: Menu courses within this section
ru: Блюда этого раздела меню

source: Course name
ru: Название блюда

source: Course composition description
ru: Описание состава блюда

source: Course price
ru: Цена блюда

source: Menu courses not belonging to any section
ru: Блюда не входящие ни в какой раздел меню

source: Restaurant not found
ru: Ресторан не найден

source: Generate QR code
ru: Сгенерировать QR код

source: Generate QR code to access the restaurant's public menu
ru: Сгенерировать QR код для доступа к меню ресторана

source: PNG image for QR code
ru: Изображение QR кода в формате PNG

source: tariff
ru: тариф

source: Name
ru: Название

source: Description
ru: Описание

source: Price per month
ru: Цена за месяц

source: Price per year
ru: Цена за год

source: user
ru: пользователь

source: users
ru: пользователи

source: phone number
ru: номер телефона

source: Log in
ru: Войти в систему

source: Log in with username and password
ru: Войти с использованием имени пользователя и пароля

source: Username
ru: Имя пользователя

source: Password
ru: Пароль

source: Success message
ru: Сообщение об успехе

source: User id
ru: Идентификатор пользователя

source: Access token
ru: Токен доступа

source: Error message - username or password not provided
ru: Сообщение об ошибке - имя пользователя или пароль не указаны

source: Error message - incorrect username or password
ru: Сообщение об ошибке - имя пользователя или пароль неверны

source: Log out
ru: Выйти из системы

source: Log out the current user
ru: Выйти из системы

source: Message: successfully logged out
ru: Сообщение: Вы вышли из системы

source: Get the problem list
ru: Получить список проблем

source: Get the list of problems of current user's restaurants
ru: Получить список проблем с данными о ресторанах текущего пользователя

source: The number of the problems found
ru: Количество обнаруженных проблем

source: The list of the problems found
ru: Список обнаруженных проблем

source: Problem description string
ru: Строка с описанием проблемы

source: Get my restaurant list
ru: Получить список своих ресторанов

source: Get the list of the current user's restaurants.
ru: Получить список ресторанов, принадлежащих текущему пользователю

source: The number of the current user's restaurants
ru: Количество ресторанов текущего пользователя

source: Restaurant list
ru: Список ресторанов

source: The list of the current user's restaurants
ru: Список ресторанов текущего пользователя

source: Restaurant's primary key
ru: Первичный ключ ресторана

source: Name and description
ru: Название и описание

source: The name and the description of the restaurant, in different languages
ru: Название и описание ресторана на разных языках

source: In English
ru: По-английски

source: The name and the description of the restaurant, in English
ru: Название и описание ресторана по английски

source: Restaurant name in English
ru: Название ресторана по английски

source: Restaurant description in English
ru: Описание ресторана по английски

source: The short URL-friendly name of the restaurant (A-Z, 0-9 and - symbols only)
ru: Короткое название ресторана для URL (только символы A-Z, 0-9 и -)

source: The restaurant's logo image URL
ru: URL логотипа ресторана

source: The restaurant's picture URL
ru: URL изображения ресторана

source: Restaurant's category ID
ru: Идентификатор категории ресторана

source: Restaurant's category data
ru: Данные о категории ресторана

source: Restaurant category primary key
ru: Первичный ключ категории ресторана

source: The name of the restaurant category, in different languages
ru: Название категории ресторана на разных языках

source: The name of the restaurant category, in English
ru: Название категории ресторана по английски

source: Restaurant category name in English
ru: Название категории по английски

source: Number of stars, greater means better and more expensive
ru: Количество звезд, чем больше тем лучше и дороже

source: Restaurant location country
ru: Страна, где находится ресторан

source: Restaurant location city
ru: Город, где находится ресторан

source: Restaurant location street
ru: Улица, где находится ресторан

source: Restaurant's building number
ru: Номер дома ресторана

source: Restaurant address extra information (entrance number, floor, etc.)
ru: Подробности адреса - например, подъезд или этаж

source: Restaurant's address ZIP code
ru: Почтовый код адреса ресторана

source: Restaurant's location longitude
ru: Долгота местонахождения ресторана

source: Restaurant's location latitude
ru: Широта местонахождения ресторана

source: Restaurant's phone number
ru: Номер телефона ресторана

source: Restaurant's website URI
ru: URL сайта ресторана

source: Currently published menu
ru: Опубликованное в данный момент меню

source: Menu primary key
ru: Первичный ключ меню

source: Username and password must be provided
ru: Необходимо ввести имя пользователя и пароль

source: Incorrect username or password
ru: Неверное имя пользователя и пароль

source: Successfully logged in
ru: Вы вошли в систему

source: Successfully logged out
ru: Вы вышли из системы
